const translation = {
  postTypes: {
    search: 'Шукаю',
    found: 'Знайшли',
  },
  route: {
    home: 'Головна',
    list: 'Заявки',
    help: 'Допомога',
    create: 'Додати заявку',
  },
  profile: {
    login: 'Увійти',
    logout: 'Вийти',
    signup: 'Реєстрація',
    loginHint: 'Оберіть сарвіс для входу',
  },
  signup: {
    map: 'Оберіть ваше місце',
    mapDescription: 'Ви зможете отримувати нові заявки в радіусі 1000м від вказаного місця',
  },
  list: {
    title: 'Пошук заявок',
    age: 'Вік',
    days: 'днів',
    radius: 'Радіус',
    meters: 'метрів',
    created: 'створено',
    notFound: 'Заявок не знайдено. Спробуйте збільшити радіус або вік заявок',
  },
  post: {
    title: 'Створення заявки "шукаю"',
    mapHint: 'Останнє місце де ви бачили вашого улюбленця',
    description: 'Опис улюбленця',
    descriptionHint: 'Будь-яка інформація що допоможе впізнати та знайти вашого улюбленця',
    photo: 'Фото вашого улюбленця',
    photoHint: 'Бажано актуальне фотого крупним планом. Розмір файлу до 10Мб.',
    submittedTitle: 'Статус заявки',
    submittedDescription: `Ваша заявка перевіряється.
Телеграм бот WIMP повідомить вас щодо результату перевірки.
Номер вашої заявки:`,
  },
  status: {
    show: 'Відобразити',
    hide: 'Приховати',
    searching: 'Пошук...',
    search: 'Шукати',
    sending: 'Відправка...',
    send: 'Надіслати',
    cancel: 'Відмовитись',
  },
};

export default translation;
