const translation = {
  postTypes: {
    search: 'Шукаю',
    found: 'Знайшли',
  },
  route: {
    home: 'Головна',
    list: 'Заявки',
    help: 'Допомога',
    create: 'Додати заявку',
  },
  profile: {
    login: 'Увійти',
    logout: 'Вийти',
    signup: 'Реєстрація',
    loginHint: 'Оберіть сервіс для входу',
  },
  signup: {
    map: 'Оберіть ваше місце',
    mapDescription: 'Ви зможете отримувати нові заявки в радіусі 1000м від вказаного місця',
  },
  list: {
    title: 'Пошук заявок',
    age: 'Вік',
    days: 'днів',
    radius: 'Радіус',
    meters: 'метрів',
    created: 'Дата створення',
    notFound: 'Заявок не знайдено. Спробуйте збільшити радіус або вік заявок.',
    by: 'Користувач',
    platform: 'Месенджер',
  },
  post: {
    title: 'Створення заявки "шукаю"',
    mapHint: 'Останнє місце де ви бачили вашого улюбленця',
    description: 'Опис улюбленця',
    descriptionHint: 'Будь-яка інформація що допоможе впізнати та знайти вашого улюбленця',
    photo: 'Фото вашого улюбленця',
    photoHint: 'Бажано актуальне фотого крупним планом. Розмір файлу до 10Мб.',
    submittedTitle: 'Статус заявки',
    submittedDescription: `Ваша заявка перевіряється.
Телеграм бот WIMP повідомить вас щодо результату перевірки.
Номер вашої заявки:`,
  },
  home: {
    title: 'Допоможемо повернути улюбленця до теплого дому',
    goal: {
      title: 'Мета',
      description: 'Допомогти загубленим домашнім улюбленцям якнайшвидше повернутись до своєї родини.',
    },
    why: {
      title: 'Навіщо?',
      description: `Нажаль, в світі дуже велика кількість безпритульних тварин, які потребують домівки.
Та найбільш вразливими серед цих тварин вважаються саме домашні тварини, адже вони геть не пристосовані
 до вуличного життя і перебування на вулиці може призвести до непередбачуваних наслідків. Тому дуже важливо
 повернути домашніх улюбленців як найшвидше додому.`,
    },
    how: {
      title: 'Як?',
      description: `За допомогою технологій якими ми користуємось щодня для спілкування - мобільні месенджери
 (додатки для відправки та отримання повідомлень). Месенжери миттєво надсилають повідомлення, та мають вбудовану
 функцію визначення місцезнаходження і можуть передавати фото. Саме це допомагає швидко та легко розповсюдити
 інформацію про загублених улюбленців.`,
    },
    todo: {
      title: 'Що треба зробити?',
      description: `Встановити один з популярних мессенждерів (телеграм або вайбер) та додати в контакти WIMP бота.
 За допомогою підказок налаштувати отримання заявок.`,
    },
    howItWorks: {
      title: 'Як це працює?',
      description: `Додавши бота в контакти та зареєструвавшись, ви матимете змогу отримувати нові заявки в заданому
 вами регіоні, та керувати самим регіоном. Ви матимите можливість надсилати заявки в разі якщо побачили
 загублену тваринку, або втратили власного улюбленця. Також, можливо зареєструватись за допомогую сайту, якщо ви
 вже маєте акаунт в мессенджері`,
    },
    whyBot: {
      title: 'Чому саме чат-боти та месенджери?',
      description: `Месенджери дозволяють якнайшвидше отримати інформацію без зайвих зусиль. Вам не потрібно
 перевіряти поштову скриньку або заходити на сайт щоб передивитись нові заявки. Чат-боти зпрощують керування системою
 заявок та запобігають винекненню людського фактору надаючи лише необхідну інформацію.`,
    },
  },
  status: {
    show: 'Відобразити',
    hide: 'Приховати',
    searching: 'Пошук...',
    search: 'Шукати',
    sending: 'Відправка...',
    send: 'Надіслати',
    cancel: 'Відмовитись',
  },
};

export default translation;
